app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "ref_post_categories" ON "categories"."id" = "ref_post_categories"."category_id" WHERE "ref_post_categories"."post_id" = ?  [["post_id", 1]]
---

  <%= select_tag("category_ids", options_for_select(Category.all.collect { |category| [category.category_name, category.id] }, @post.categories.collect { |category| category.id})) %>