app/views/posts/index.html.erb

SELECT "categories".* FROM "categories"
---
    <%= link_to "All", posts_path %><br>
    <% @categories = Category.all %>

SELECT "categories".* FROM "categories" INNER JOIN "ref_post_categories" ON "categories"."id" = "ref_post_categories"."category_id" WHERE "ref_post_categories"."post_id" = ?  [["post_id", 1]]
---
    <p class="category">
      <% post.categories.each do |c|%>