app/views/posts/show.html.erb

    <%= link_to "All", posts_path %><br>
    <% @categories = Category.all %>
---
SELECT "categories".* FROM "categories"

  <p class="category">
    <% @post.categories.each do |c|%>
---
SELECT "categories".* FROM "categories" INNER JOIN "ref_post_categories" ON "categories"."id" = "ref_post_categories"."category_id" WHERE "ref_post_categories"."post_id" = ?  [["post_id", 1]]

    <div class = "subcomment">
      <% comment.subcomments.each do |subcomment| %>
---
SELECT "subcomments".* FROM "subcomments" WHERE "subcomments"."comment_id" = ?  [["comment_id", 1]]