app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("text", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "Comment1"], ["post_id", 1], ["created_at", "2015-02-13 10:25:57.197415"], ["updated_at", "2015-02-13 10:25:57.197415"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(coment_params)
    @comment.save