app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "categories".* FROM "categories" INNER JOIN "ref_post_categories" ON "categories"."id" = "ref_post_categories"."category_id" WHERE "ref_post_categories"."post_id" = ?  [["post_id", 1]]
---
  def category
    @posts = []
    @c
    @p = Post.all
    @p.each do |post|
      post.categories.each do |c|

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "ref_post_categories" ("category_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["post_id", 1], ["created_at", "2015-02-13 10:24:19.372078"], ["updated_at", "2015-02-13 10:24:19.372078"]]
---
  def create
    @post = Post.new(post_params)



    respond_to do |format|
      if @post.save
        if RefPostCategory.create(category_id: params[:category_ids], post_id: @post.id)