app/controllers/subcomments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "subcomments" ("text", "comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "www"], ["comment_id", 1], ["created_at", "2015-02-13 10:44:04.614022"], ["updated_at", "2015-02-13 10:44:04.614022"]]
---
  def create
    @comment = Comment.find(params[:comment_id])
    @subcomment = @comment.subcomments.build(subcoment_params)
    @subcomment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "subcomments".* FROM "subcomments" WHERE "subcomments"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "subcomments" WHERE "subcomments"."id" = ?  [["id", 2]]
---
  def destroy
    @subcomment = Subcomment.find(params[:id])
    @subcomment.destroy